# ── Terminal & shell ─────────────────────────────────────────────────
cask "ghostty"                 # GPU-accelerated terminal
brew "starship"                # prompt
brew "zsh-autosuggestions"     # fish-like grey ghost suggestions
brew "zsh-syntax-highlighting" # color commands as you type
brew "tmux"
brew "stow"                    # symlink manager for dotfiles

# ── Editor ───────────────────────────────────────────────────────────
brew "neovim"

# ── CLI essentials ───────────────────────────────────────────────────
brew "git"
brew "gh"                      # GitHub CLI
brew "ripgrep"                 # rg — used by telescope.nvim
brew "fd"                      # better find
brew "fzf"                     # fuzzy finder
brew "bat"                     # syntax-highlighted cat
brew "eza"                     # better ls
brew "zoxide"                  # better cd (frecency-based)
brew "lazygit"                 # git TUI
brew "btop"                    # system monitor
brew "jq"                      # JSON
brew "yq"                      # YAML
brew "tree"
brew "wget"
brew "httpie"                  # better curl for APIs
cask "1password-cli"           # 1Password CLI

# ── Languages / build ────────────────────────────────────────────────
brew "node"
brew "pyenv"                   # python version manager
brew "uv"                      # fast python package manager (replaces pip+venv)
brew "cmake"
brew "platformio"              # ESP32 / Arduino toolchain (for the gimbal)

# ── Fonts (Nerd Fonts give you the icons in eza/starship/etc) ────────
cask "font-jetbrains-mono-nerd-font"
cask "font-fira-code-nerd-font"

# ── GUI apps you probably want anyway ────────────────────────────────
cask "rectangle"               # window snapping
cask "raycast"                 # spotlight replacement
